<PAD>
<UNK>
<SP>
<S>
</S>
!
#
$
%
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~

£
¥
§
¯
°
³
´
·
º
¿
×
ß
à
÷
đ
ƪ
ư
ʔ
ʕ
˂
˃
ˑ
˘
˙
˚
˝
˵
˶
̄
̆
̈
̊
̌
̎
̐
̑
̣
̤
̥
̩
̫
̮
̳
̴
̶
̷
̻
͒
͘
΄
ε
ρ
ω
ࡇ
ॱ
ଳ
౪
ฅ
๑
ຶ
່
༎
ཀ
ོ
ღ
ᄀ
ᄃ
ᄅ
ᄆ
ᄉ
ᄋ
ᄒ
ᆞ
ᆢ
ᐛ
ᗜ
ᴗ
ᴥ
ᵔ
ᵕ
᷀
᷁
᷄
᷅
ạ
ấ
ặ
ợ

‍
‎
–
—
‘
’
“
”
•
‥
…
‸
‹
›
※
‼
‾
‿
⁴
⁸
⁺
₩
⃫
→
↗
∠
≖
≠
⌓
▽
▾
○
●
◔
◜
◝
◞
◟
◡
☄
★
☆
☺
☼
☾
♀
♂
♡
♥
♧
♪
⚈
⚠
✊
✋
✌
❁
❌
❓
❗
❣
❤
⫬
⭐
、
「
」
〰
い
う
お
か
が
し
た
っ
つ
で
な
に
は
ょ
ん
ゝ
ノ
ヽ
ㄱ
ㄲ
ㄳ
ㄴ
ㄵ
ㄶ
ㄷ
ㄸ
ㄹ
ㄺ
ㄻ
ㄼ
ㄾ
ㅀ
ㅁ
ㅂ
ㅃ
ㅄ
ㅅ
ㅆ
ㅇ
ㅈ
ㅉ
ㅊ
ㅋ
ㅌ
ㅍ
ㅎ
ㅏ
ㅐ
ㅑ
ㅒ
ㅓ
ㅔ
ㅕ
ㅖ
ㅗ
ㅘ
ㅙ
ㅚ
ㅛ
ㅜ
ㅝ
ㅞ
ㅟ
ㅠ
ㅡ
ㅢ
ㅣ
ㆍ
㉯
一
上
下
不
中
么
书
了
于
人
介
你
倒
先
凸
别
到
博
句
吃
向
商
四
埸
多
失
季
宮
容
寛
对
尊
就
平
廣
形
後
得
心
快
怎
想
成
我
打
把
拉
暖
暴
望
机
李
權
此
水
生
电
的
益
着
给
苟
行
要
见
话
读
貴
輩
道
都
重
银
长
高
ꇴ
ꈊ
ꉂ
꒪
꙼
가
각
갂
갃
간
갅
갆
갇
갈
갉
갊
갌
감
갑
값
갓
갔
강
갖
갗
갘
같
갚
갛
개
객
갞
갠
갣
갤
갬
갭
갯
갰
갱
갲
갳
갴
갵
갶
갷
갸
갹
갼
걀
걈
걉
걋
걌
걍
걏
걐
걑
걔
걕
걘
걜
걮
거
걱
걲
걳
건
걷
걸
걺
걻
검
겁
겂
것
겄
겅
겆
겇
겈
겉
겊
겋
게
겍
겎
겐
겓
겔
겕
겜
겝
겟
겠
겡
겤
겥
겦
겧
겨
격
겪
견
결
겸
겹
겻
겼
경
겾
겿
곀
곁
곂
곃
계
곈
곌
곔
곗
곘
곚
곜
곝
고
곡
곢
곤
곥
곦
곧
골
곪
곬
곯
곰
곱
곳
곴
공
곶
곷
곸
곹
곺
곻
과
곽
관
괃
괄
괌
괍
광
괒
괔
괕
괘
괜
괞
괟
괨
괬
괭
괮
괯
괰
괴
괵
괸
괼
굄
굇
굉
굎
교
굑
굔
굗
굘
굠
굡
굣
굥
굦
굨
굫
구
국
굮
굯
군
굳
굴
굵
굶
굻
굼
굽
굿
궁
궂
궄
궅
궆
궇
궈
궉
권
궐
궛
궜
궝
궤
귀
귁
귄
귆
귈
귐
귓
귕
귗
귘
규
귝
균
귣
귤
귬
귯
귱
귴
귷
그
극
귺
귻
근
귾
귿
글
긁
긂
긇
금
급
긋
긌
긍
긎
긏
긐
긑
긓
긔
긘
긜
긤
긧
긩
긬
기
긱
긲
긴
긵
긶
긷
길
긹
긿
김
깁
깃
깄
깅
깆
깇
깈
깉
깊
깋
까
깍
깎
깐
깓
깔
깖
깜
깝
깟
깠
깡
깢
깤
깥
깦
깧
깨
깩
깪
깬
깰
깸
깹
깻
깼
깽
꺀
꺁
꺄
꺅
꺈
꺌
꺍
꺔
꺗
꺘
꺙
꺜
꺟
꺠
꺤
꺳
꺵
꺼
꺽
꺾
껀
껄
껆
껌
껍
껏
껐
껑
껒
껔
껕
껗
께
껙
껜
껠
껨
껩
껫
껬
껭
껰
껱
껳
껴
껸
껼
꼄
꼇
꼈
꼉
꼌
꼍
꼐
꼘
꼤
꼥
꼨
꼬
꼭
꼮
꼰
꼳
꼴
꼼
꼽
꼿
꽀
꽁
꽂
꽃
꽄
꽅
꽇
꽈
꽉
꽌
꽐
꽛
꽝
꽤
꽥
꽹
꾀
꾄
꾜
꾤
꾸
꾹
꾼
꾾
꾿
꿀
꿇
꿈
꿉
꿋
꿍
꿏
꿐
꿑
꿓
꿔
꿘
꿧
꿨
꿩
꿬
꿰
뀌
뀐
뀔
뀜
뀠
뀨
뀩
뀬
뀰
뀸
뀹
뀻
뀽
끂
끄
끅
끈
끊
끋
끌
끍
끓
끔
끕
끗
끘
끙
끛
끜
끝
끞
끟
끠
끨
끰
끵
끼
끽
끾
낀
낄
낌
낍
낏
낑
낓
낔
나
낙
낚
난
낝
낞
낟
날
낡
낢
낥
낦
낧
남
납
낫
났
낭
낮
낯
낰
낱
낲
낳
내
낵
낶
낸
낻
낼
낾
냀
냂
냄
냅
냇
냈
냉
냊
냌
냍
냏
냐
냑
냔
냗
냘
냠
냡
냣
냤
냥
냦
냨
냩
냪
냫
냬
냼
넁
넄
너
넉
넋
넌
넎
넏
널
넒
넓
넘
넙
넚
넛
넜
넝
넞
넠
넢
넣
네
넥
넨
넪
넫
넬
넴
넵
넷
넸
넹
넺
넻
넼
넽
넾
넿
녀
녁
녂
년
녇
녈
념
녑
녓
녔
녕
녖
녘
녛
녜
녠
녤
녭
녯
녱
녴
노
녹
논
녾
녿
놀
놈
놉
놋
농
놏
놐
놑
높
놓
놔
놖
놘
놤
놧
놨
놩
놬
놯
놰
놸
뇄
뇅
뇌
뇎
뇨
뇩
뇬
뇰
뇸
뇹
뇻
뇽
눀
누
눅
눈
눋
눌
눏
눔
눕
눗
눘
눙
눚
눜
눞
눠
눤
눨
눳
눴
눵
눼
뉍
뉑
뉔
뉘
뉜
뉠
뉨
뉩
뉫
뉭
뉰
뉴
뉵
뉸
뉼
늄
늇
늉
늊
늌
느
늑
늒
는
늕
늗
늘
늙
늟
늠
늡
늣
능
늦
늧
늨
늩
늪
늫
늬
늭
닁
니
닉
닊
닌
닏
닐
닑
닒
님
닙
닛
닜
닝
닞
닟
닠
닡
닢
닣
다
닥
닦
닧
단
닪
닫
달
닭
닮
닯
닰
닳
담
답
닶
닷
당
닺
닻
닼
닽
닾
닿
대
댁
댄
댇
댈
댉
댌
댐
댑
댓
댔
댕
댖
댗
댘
댙
댚
댛
댜
댠
댣
댤
댬
댭
댯
댰
댱
댴
댸
덋
덍
더
덕
던
덛
덜
덟
덤
덥
덦
덧
덨
덩
덫
덬
덭
덮
덯
데
덱
덴
덷
델
뎀
뎁
뎃
뎄
뎅
뎆
뎇
뎈
뎉
뎊
뎋
뎌
뎍
뎐
뎘
뎟
뎠
뎡
뎤
뎨
뎬
뎽
도
독
돇
돈
돉
돋
돌
돍
돔
돕
돗
동
돚
돛
돜
돝
돞
돟
돠
돤
돨
돰
돳
돴
돵
돼
돽
됀
됄
됌
됍
됏
됐
됑
됒
됔
됕
됗
되
됙
된
됞
됟
될
됡
됨
됩
됫
됬
됭
됮
됰
됲
됳
됴
됵
됸
됼
둅
둉
두
둑
둒
둔
둗
둘
둚
둟
둠
둡
둣
둥
둦
둧
둨
둩
둪
둫
둬
둰
둿
뒀
뒁
뒄
뒈
뒘
뒝
뒤
뒨
뒷
뒸
뒹
듀
듁
듄
듇
듈
듐
듑
듓
듕
드
득
듟
든
듡
듢
듣
들
듥
듦
듧
듨
듫
듬
듭
듯
등
듲
듳
듴
듵
듶
듷
듸
듹
듼
딉
딋
디
딕
딘
딛
딜
딤
딥
딧
딨
딩
딪
딫
딬
딭
딮
따
딱
딲
딳
딴
딷
딸
딹
딻
땀
땁
땃
땄
땅
땆
땈
땉
땋
때
땍
땐
땓
땔
땜
땝
땟
땠
땡
땢
땤
땦
땨
땬
땰
땸
땼
땽
떀
떄
떈
떌
떔
떗
떙
떜
떠
떡
떢
떤
떧
떨
떪
떫
떯
떰
떱
떳
떴
떵
떸
떻
떼
떽
뗀
뗄
뗌
뗏
뗐
뗑
뗔
뗗
뗘
뗙
뗫
뗬
뗭
뗴
뗵
또
똑
똒
똔
똗
똘
똜
똠
똣
똥
똧
똨
똩
똬
똭
똴
뙁
뙄
뙇
뙈
뙤
뙨
뚀
뚁
뚕
뚜
뚝
뚟
뚠
뚤
뚫
뚬
뚭
뚯
뚱
뚴
뚷
뚸
뛀
뛔
뛰
뛴
뛸
뜀
뜁
뜅
뜌
뜜
뜨
뜩
뜪
뜬
뜮
뜯
뜰
뜸
뜹
뜻
뜽
띁
띄
띈
띌
띔
띠
띡
띤
띨
띰
띱
띳
띵
띸
라
락
띾
란
랂
랃
랄
랅
랈
랋
람
랍
랏
랐
랑
랒
랓
랔
랕
랖
랗
래
랙
랚
랜
랟
랠
랡
램
랩
랫
랬
랭
랮
랯
랰
랱
랲
랳
랴
략
랸
랼
럄
럅
럇
럈
량
럌
럏
럐
럗
럣
럤
러
럭
럯
런
럱
럲
럳
럴
럵
럸
럻
럼
럽
럾
럿
렀
렁
렂
렃
렄
렅
렆
렇
레
렉
렊
렋
렌
렐
렘
렙
렛
렜
렝
렞
렠
렡
렢
렣
려
력
련
렪
렫
렬
렴
렵
렷
렸
령
렺
렻
렼
렿
례
롄
롈
롑
롓
롔
롕
롘
로
록
론
롣
롤
롥
롫
롬
롭
롮
롯
롰
롱
롲
롳
롴
롷
롸
롹
롼
뢀
뢈
뢋
뢍
뢐
뢓
뢔
뢧
뢩
뢰
뢱
룈
료
룍
룐
룜
룝
룟
룡
룤
룥
루
룩
룬
룯
룰
룸
룹
룻
룽
룾
뤀
뤂
뤃
뤄
뤈
뤌
뤔
뤗
뤘
뤙
뤜
뤠
뤡
뤱
뤵
뤼
륀
륄
륌
륍
륏
륑
류
륙
륜
률
륨
륩
륭
륯
륰
르
륵
륶
륷
른
륹
륻
를
륽
릃
름
릅
릇
릉
릊
릋
릌
릍
릎
릏
릐
릔
릠
릥
리
릭
린
릱
릳
릴
릵
릶
림
립
릿
맀
링
맂
맃
맄
맅
맆
맇
마
막
맊
만
맍
많
맏
말
맑
맒
맓
맔
맕
맗
맘
맙
맛
맜
망
맞
맟
맠
맡
맣
매
맥
맨
맩
맫
맬
맴
맵
맷
맸
맹
맺
맻
맼
맽
맿
먀
먁
먄
먈
먐
먑
먓
먕
먖
먗
먛
머
먹
먺
먻
먼
먽
먾
먿
멀
멂
멈
멉
멊
멋
멌
멍
멎
멏
멐
멓
메
멕
멘
멛
멜
멤
멥
멧
멩
멫
멬
멭
멮
며
멱
면
멵
멶
멷
멸
몀
몃
몄
명
몆
몇
몈
몉
몌
몐
모
목
몫
몬
몯
몰
몶
몷
몸
몹
못
몽
몾
몿
뫀
뫃
뫄
뫈
뫌
뫘
뫙
뫚
뫠
뫴
뫼
묀
묘
묜
묠
묨
묫
묭
묯
묰
무
묵
묶
문
묹
묺
묻
물
묽
묾
뭃
뭄
뭅
뭇
뭉
뭊
뭌
뭍
뭎
뭏
뭐
뭑
뭔
뭕
뭗
뭘
뭠
뭡
뭣
뭥
뭦
뭨
뭫
뭬
뭴
뭿
뮈
뮌
뮐
뮝
뮟
뮤
뮥
뮨
뮫
뮬
뮴
뮷
뮹
뮿
므
믁
믂
믄
믇
믈
믉
믐
믓
믕
믖
믘
믜
믠
믱
미
믹
믺
민
믽
믾
믿
밀
밈
밉
밋
밌
밍
밎
및
밐
밑
밓
바
박
밖
반
밚
받
발
밝
밞
밟
밡
밣
밤
밥
밧
밨
방
밪
밫
밬
밭
밯
배
백
밴
밷
밸
뱀
뱁
뱃
뱅
뱆
뱇
뱈
뱉
뱌
뱍
뱐
뱓
뱔
뱜
뱝
뱟
뱡
뱥
버
벅
벆
번
벉
벋
벌
벎
범
법
벖
벗
벘
벙
벚
벜
벝
벞
벟
베
벡
벤
벧
벨
벰
벱
벳
벴
벵
벶
벸
벹
벼
벽
변
볃
별
볌
볍
볏
볐
병
볒
볓
볔
볕
보
복
볶
본
볹
볻
볼
볽
볾
볿
봄
봅
봇
봈
봉
봊
봋
봌
봍
봏
봐
봑
봒
봔
봗
봘
봠
봡
봣
봤
봥
봦
봨
봩
봪
봫
봬
봭
뵀
뵈
뵌
뵏
뵐
뵘
뵙
뵛
뵜
뵝
뵞
뵤
뵥
뵨
뵬
뵴
뵵
뵹
뵼
부
북
붂
분
붇
불
붉
붎
붐
붑
붓
붕
붖
붗
붘
붙
붛
붜
붠
붤
붭
붱
붴
붸
붹
뷁
뷉
뷔
뷘
뷜
뷤
뷰
뷱
뷴
뷸
븀
븅
븈
븉
브
븍
븐
블
븜
븝
븟
븡
븢
븣
븤
븥
븦
븧
븨
비
빅
빆
빈
빋
빌
빔
빕
빗
빘
빙
빚
빛
빜
빝
빟
빠
빡
빢
빤
빧
빨
빰
빱
빳
빴
빵
빶
빸
빹
빺
빻
빼
빽
뺀
뺄
뺌
뺍
뺏
뺐
뺑
뺘
뺙
뺠
뺨
뺫
뺴
뺵
뺼
뻇
뻈
뻐
뻑
뻒
뻔
뻗
뻘
뻚
뻠
뻡
뻣
뻤
뻥
뻨
뻪
뻬
뼈
뼉
뼌
뼏
뼙
뼛
뼝
뽀
뽁
뽂
뽄
뽇
뽈
뽐
뽑
뽕
뽖
뽜
뽝
뽞
뽤
뽱
뽷
뾰
뾱
뾸
뿁
뿅
뿌
뿍
뿐
뿓
뿔
뿜
뿝
뿟
뿡
뿧
뿨
쀄
쀠
쀼
쀽
쁀
쁑
쁘
쁙
쁜
쁟
쁠
쁨
쁩
쁫
쁭
쁮
쁴
쁼
삐
삑
삔
삘
삣
삤
삥
삨
사
삭
삮
삯
산
삲
삳
살
삵
삶
삻
삼
삽
삿
샀
상
샂
샃
샄
샅
샆
샇
새
색
샊
샌
샏
샐
샒
샘
샙
샛
샜
생
샞
샠
샡
샢
샣
샤
샥
샨
샪
샬
샴
샵
샷
샸
샹
샺
샾
섀
섄
섕
서
석
섞
섟
선
섣
설
섦
섩
섬
섭
섯
섰
성
섲
섴
섵
섶
섷
세
섹
센
셀
셇
셈
셉
셋
셌
셍
셏
셐
셑
셒
셓
셔
셕
션
셜
셤
셥
셧
셨
셩
셬
셯
셰
셱
소
속
손
솓
솔
솛
솜
솝
솟
솠
송
솤
솥
솦
솨
솬
솰
솹
솻
솼
쇄
쇅
쇈
쇟
쇠
쇡
쇱
쇳
쇼
쇽
숀
숄
숍
숏
숐
숑
숔
숖
숗
수
숙
순
숟
술
숨
숩
숫
숭
숮
숯
숰
숱
숲
숳
숴
숵
숸
쉅
쉇
쉈
쉉
쉊
쉐
쉑
쉗
쉘
쉠
쉡
쉣
쉨
쉩
쉫
쉬
쉭
쉰
쉴
쉼
쉽
쉿
슁
슂
슄
슆
슈
슉
슌
슐
슘
슙
슛
슝
슢
스
슥
슦
슨
슪
슫
슬
슮
슴
습
슷
승
슺
슻
슼
슽
슾
슿
싀
싁
싄
싈
싐
싑
싓
싕
시
식
싞
신
싡
싢
싣
실
싥
싦
싨
싪
싫
심
십
싮
싯
싰
싱
싲
싳
싴
싵
싶
싷
싸
싹
싼
싿
쌀
쌈
쌉
쌋
쌌
쌍
쌎
쌐
쌓
쌔
쌕
쌘
쌛
쌜
쌤
쌥
쌧
쌩
쌰
쌱
쌴
썀
썁
썅
썌
썜
썡
써
썩
썪
썬
썯
썰
썸
썹
썻
썼
썽
썾
쎀
쎂
쎃
쎄
쎅
쎈
쎋
쎌
쎔
쎕
쎗
쎘
쎙
쎠
쎵
쎼
쏀
쏌
쏘
쏙
쏜
쏟
쏠
쏤
쏨
쏩
쏫
쏬
쏭
쏰
쏴
쏵
쏼
쐇
쐈
쐐
쐬
쐴
쑈
쑝
쑤
쑥
쑨
쑬
쑭
쑴
쑵
쑹
쑻
쒀
쒁
쒈
쒕
쒘
쒜
쒝
쒤
쒯
쒵
쒸
쒹
쒼
쓉
쓍
쓐
쓔
쓕
쓤
쓩
쓰
쓱
쓴
쓶
쓷
쓸
쓺
씀
씁
씃
씅
씆
씈
씉
씋
씌
씍
씐
씜
씝
씡
씤
씨
씩
씪
씬
씯
씰
씸
씹
씻
씼
씽
씾
앀
아
악
앆
안
앉
않
앋
알
앍
앎
앏
앐
앑
앓
암
압
앖
앗
았
앙
앚
앛
앜
앝
앞
앟
애
액
앤
앧
앨
앩
앰
앱
앳
앴
앵
앶
앸
앺
앻
야
약
앾
앿
얀
얁
얂
얃
얄
얆
얇
얌
얍
얎
얏
얐
양
얒
얓
얔
얕
얖
얗
얘
얙
얚
얜
얭
어
억
얶
얷
언
얹
얺
얻
얼
얽
얾
얿
엁
엄
업
없
엇
었
엉
엊
엋
엌
엍
엎
엏
에
엑
엓
엔
엗
엘
엙
엠
엡
엢
엣
엤
엥
엦
엧
엨
엩
엪
엫
여
역
엮
엯
연
엲
엳
열
엵
엶
엷
엸
염
엽
엾
엿
였
영
옂
옃
옄
옅
옆
옇
예
옌
옐
옘
옙
옛
옜
옝
옠
옢
오
옥
온
옪
옫
올
옭
옮
옯
옰
옳
옴
옵
옶
옷
옸
옹
옺
옻
옼
옽
옾
옿
와
왁
왂
완
왅
왇
왈
왐
왑
왓
왔
왕
왖
왘
왙
왚
왛
왜
왝
왟
왠
왤
왬
왭
왯
왰
왱
왲
왴
왵
왶
왷
외
왼
욀
욋
욌
욐
욓
요
욕
욖
욘
욛
욜
욝
욣
욤
욥
욧
욨
용
욪
욫
욬
욭
욮
욯
우
욱
운
욵
욷
울
욹
욺
욽
욿
움
웁
웂
웃
웄
웅
웆
웈
웉
웊
웋
워
웍
웎
원
웒
웓
월
웕
웜
웝
웟
웠
웡
웣
웤
웧
웨
웩
웬
웯
웰
웸
웹
웻
웽
윃
위
윅
윈
윋
윌
윔
윕
윗
윘
윙
윟
유
육
윤
윧
율
윰
윱
윳
융
윶
윷
윸
윻
으
윽
윾
은
읁
읂
읃
을
읅
읆
읈
읉
읊
읋
음
읍
읎
읏
응
읒
읔
읕
읖
읗
의
읙
읜
읨
읩
읪
읫
읬
읭
읮
읯
읰
이
익
읶
인
읹
읺
읻
일
읽
읾
읿
잀
잃
임
입
잇
있
잉
잊
잋
잌
잍
잎
잏
자
작
잒
잔
잕
잖
잗
잘
잚
잛
잜
잠
잡
잣
잤
장
잦
잧
잨
잩
잫
재
잭
잮
잰
잲
잴
잼
잽
잿
쟀
쟁
쟂
쟄
쟈
쟉
쟊
쟌
쟎
쟏
쟐
쟘
쟙
쟛
쟜
쟝
쟞
쟠
쟡
쟤
쟨
쟬
쟸
저
적
젂
전
젅
젆
젇
절
젊
젋
젍
젏
점
접
젓
젔
정
젖
젘
젛
제
젝
젠
젤
젫
젬
젭
젯
젱
젲
젳
젴
젷
져
젹
젺
젼
젾
젿
졀
졈
졉
졋
졌
졍
졎
졐
졒
졓
졔
조
족
졲
존
졵
졷
졸
졺
졿
좀
좁
좃
종
좆
좇
좈
좊
좋
좌
좍
좐
좔
좜
좝
좞
좟
좠
좡
좢
좤
좨
좸
좻
좽
죄
죈
죌
죔
죕
죗
죙
죠
죡
죤
죨
죰
죱
죳
죴
죵
죶
죷
죸
죹
죺
죻
주
죽
준
줃
줄
줅
줆
줉
줌
줍
줎
줏
줐
중
줒
줓
줔
줕
줗
줘
줙
줚
줜
줟
줠
줩
줫
줬
줭
줮
줰
줱
줳
줴
줸
줼
쥄
쥉
쥐
쥑
쥔
쥘
쥠
쥡
쥣
쥤
쥥
쥦
쥨
쥬
쥭
쥰
쥴
쥼
쥽
즁
즄
즇
즈
즉
즌
즎
즏
즐
즘
즙
즛
증
즞
즠
즣
즤
즥
즨
즵
즹
지
직
짂
진
짅
짆
짇
질
짊
짌
짍
짏
짐
집
짓
징
짖
짗
짘
짙
짚
짛
짜
짝
짞
짠
짢
짣
짤
짦
짧
짪
짬
짭
짯
짰
짱
짲
짴
짵
짶
짷
째
짹
짺
짼
짿
쨀
쨃
쨈
쨉
쨋
쨌
쨍
쨐
쨔
쨕
쨘
쨜
쨤
쨥
쨧
쨨
쨩
쨰
쩀
쩃
쩄
쩅
쩌
쩍
쩐
쩓
쩔
쩕
쩖
쩜
쩝
쩟
쩠
쩡
쩤
쩧
쩨
쩰
쩻
쪄
쪈
쪌
쪔
쪕
쪗
쪘
쪙
쪜
쪞
쪟
쪠
쪼
쪽
쪾
쪿
쫀
쫂
쫃
쫄
쫋
쫌
쫍
쫏
쫑
쫒
쫓
쫗
쫘
쫙
쫜
쫠
쫩
쫭
쬇
쬐
쬔
쬘
쬠
쬥
쬬
쬭
쬰
쬴
쬼
쬽
쬿
쭁
쭇
쭈
쭉
쭊
쭌
쭐
쭘
쭙
쭝
쭞
쭤
쭨
쭷
쮀
쮜
쮝
쮤
쮬
쮱
쮸
쮹
쯀
쯈
쯍
쯔
쯕
쯘
쯜
쯤
쯥
쯧
쯩
쯪
쯬
쯰
찁
찅
찈
찌
찍
찎
찐
찓
찔
찜
찝
찟
찡
찢
찤
찧
차
착
찪
찬
찭
찮
찯
찰
찷
참
찹
찻
찼
창
찾
찿
챀
챂
챃
채
책
챈
챌
챔
챕
챗
챘
챙
챚
챜
챟
챠
챡
챤
챦
챧
챨
챰
챱
챳
챴
챵
챸
처
척
천
첞
첟
철
첢
첨
첩
첫
첬
청
첮
첰
첳
체
첵
첸
첼
쳄
쳇
쳉
쳊
쳌
쳐
쳑
쳒
쳔
쳘
쳠
쳡
쳣
쳤
쳥
쳨
쳩
쳪
쳫
쳬
초
촉
촌
촐
촘
촛
총
촞
촠
촣
촤
촥
촬
촴
촵
촼
쵀
쵁
최
쵝
쵭
쵱
쵸
쵹
쵼
춈
춉
춋
춌
춍
춐
추
축
춘
춚
춛
출
춝
춠
춤
춥
춦
춧
충
춪
춬
춰
춱
춴
춸
췃
췄
췅
췈
췋
췌
췍
췜
췟
췡
취
췩
췬
췸
췹
췻
췽
췾
츄
츅
츈
츊
츌
츔
츕
츙
츛
츜
츝
츠
측
츢
츤
츧
츨
츰
츳
층
츻
츼
칀
칄
칑
치
칙
칚
친
칞
칟
칠
칡
침
칩
칪
칫
칭
칮
칯
칰
카
칵
칷
칸
칼
캄
캅
캇
캉
캌
캍
캎
캐
캑
캔
캗
캘
캠
캡
캣
캤
캥
캨
캪
캫
캬
캭
캮
캰
캴
캼
캽
캿
컀
컁
컄
커
컥
컨
컬
컴
컵
컷
컸
컹
컺
컻
컼
컽
컾
케
켁
켂
켄
켇
켈
켐
켑
켓
켔
켕
켖
켘
켙
켛
켜
켞
켠
켤
켬
켭
켯
켰
켱
켴
켸
코
콕
콘
콛
콜
콤
콥
콧
콩
콪
콫
콬
콭
콰
콱
콴
콸
쾃
쾅
쾌
쾐
쾤
쾨
쿄
쿊
쿔
쿕
쿗
쿙
쿜
쿟
쿠
쿡
쿤
쿨
쿰
쿱
쿳
쿵
쿷
쿸
쿹
쿼
퀀
퀄
퀏
퀘
퀭
퀴
퀵
퀸
퀼
큄
큉
큌
큏
큐
큑
큔
큘
큣
큥
큨
큩
크
큭
큯
큰
클
큹
큼
큽
큿
킁
킂
킄
킅
킇
킈
킘
킝
킡
키
킥
킨
킪
킫
킬
킳
킴
킵
킷
킹
킼
킽
킿
타
탁
탂
탄
탆
탇
탈
탉
탌
탐
탑
탓
탔
탕
탖
탘
탙
탚
탛
태
택
탠
탤
탬
탭
탯
탰
탱
탴
탸
탹
탼
턈
턉
턍
턑
턔
터
턱
턳
턴
턷
털
텀
텁
텂
텃
텄
텅
텆
텈
텉
텋
테
텍
텐
텔
텙
템
텝
텟
텠
텡
텤
텥
텨
텩
텪
텬
텻
텼
톀
톄
토
톡
톤
톧
톨
톰
톱
톳
통
톸
톼
톽
퇄
퇌
퇗
퇘
퇴
퇵
툇
툌
툐
툘
툥
툩
투
툭
툰
툳
툴
툼
툽
툿
퉁
퉂
퉃
퉄
퉅
퉆
퉈
퉐
퉛
퉤
퉷
퉹
튀
튁
튄
튈
튐
튑
튓
튕
튘
튜
튝
튠
튤
튬
튭
튱
튶
트
특
튻
튼
튿
틀
틂
틈
틉
틋
틍
틎
틐
틑
틓
틔
틧
틩
티
틱
틴
틷
틸
팀
팁
팃
팄
팅
팆
팈
팉
팋
파
팍
팎
판
팒
팓
팔
팖
팛
팜
팝
팟
팠
팡
팢
팤
팥
팦
팧
패
팩
팬
팯
팰
팸
팹
팻
팼
팽
퍀
퍄
퍈
퍘
퍙
퍼
퍽
펀
펄
펌
펍
펏
펐
펑
펒
펔
페
펙
펜
펟
펠
펨
펩
펫
펭
펰
펱
펲
펳
펴
편
펹
펺
펼
폄
폇
폈
평
폌
폐
포
폭
폰
폱
폳
폴
폼
폽
폿
퐁
퐂
퐄
퐅
퐆
퐈
퐉
퐌
퐝
푀
표
푝
푠
푭
푱
푸
푹
푼
푿
풀
풁
품
풉
풋
풍
풐
풒
풓
풔
풜
풰
풱
풴
퓌
퓜
퓨
퓸
퓻
픂
프
픅
픇
픈
픉
픋
플
픎
픓
픔
픕
픗
픘
픙
픚
픜
픟
픠
피
픽
핀
필
핅
핉
핌
핍
핏
핑
핔
핕
핖
핗
하
학
핚
핛
한
핝
핞
핟
할
핡
핢
핣
핤
핥
핦
핧
함
합
핫
핬
항
핮
핯
핰
핱
핲
핳
해
핵
핶
핸
핺
핻
핼
햄
햅
햇
했
행
햊
햋
햌
햍
햎
햏
햐
햑
햔
햘
햝
햠
햡
햣
햤
향
햨
햫
햬
햿
헀
헁
허
헉
헊
헌
헏
헐
헑
헕
험
헙
헛
헜
헝
헠
헣
헤
헥
헨
헫
헬
헳
헴
헷
헸
헹
헼
헿
혀
혁
현
혇
혈
혐
협
혓
혔
형
혖
혘
혛
혜
혠
혤
호
혹
혼
혿
홀
홅
홈
홉
홋
홍
홎
홐
홓
화
확
홗
환
홛
활
홣
홤
홥
홧
황
홪
홬
홯
홰
홱
횃
회
획
횐
횔
횟
횡
횤
효
횬
횰
횻
횼
횽
횾
훀
훃
후
훅
훈
훋
훌
훑
훓
훔
훕
훗
훙
훚
훜
훝
훟
훠
훤
훨
훵
훼
훽
휍
휑
휘
휙
휜
휟
휠
휨
휩
휫
휭
휯
휴
휵
휸
휼
흄
흇
흉
흌
흏
흐
흑
흒
흔
흗
흘
흙
흝
흠
흡
흣
흤
흥
흦
흨
흩
흫
희
흭
흰
흴
흼
힁
힂
힄
히
힉
힌
힏
힐
힘
힙
힛
힜
힝
힞
힠
힡
힢
힣
李
︎
️
﹏
！
（
）
，
：
？
＾
＿
｀
｡
ﾟ
￥
🌈
🌝
🌟
🎉
🎊
🏻
👊
👍
💓
💕
💗
💘
💚
💛
💜
💥
💦
🔥
😂
😄
😅
😆
😉
😊
😌
😍
😎
😑
😘
😙
😝
😥
😨
😭
😱
😶
🙏
🤔
🤭
🥰
🥺
